{
  "source": "hackernews",
  "url": "https://thehackernews.com/2025/04/critical-commvault-command-center-flaw.html",
  "title": "Critical Commvault Command Center Flaw Enables Attackers to Execute Code Remotely",
  "published": null,
  "body": "A critical security flaw has been disclosed in the Commvault Command Center that could allow arbitrary code execution on affected installations.\nThe vulnerability, tracked as CVE-2025-34028 , carries a CVSS score of 9.0 out of a maximum of 10.0.\n\"A critical security vulnerability has been identified in the Command Center installation, allowing remote attackers to execute arbitrary code without authentication,\" Commvault said in an advisory published on April 17, 2025. \"This vulnerability could lead to a complete compromise of the Command Center environment.\"\nIt impacts the 11.38 Innovation Release, from versions 11.38.0 through 11.38.19, and has been resolved in the following versions -\nwatchTowr Labs researcher Sonny Macdonald, who has been credited with discovering and reporting the flaw on April 7, 2025, said in a report shared with The Hacker News that it could be exploited to achieve pre-authenticated remote code execution.\nSpecifically, the issue is rooted in an endpoint called \"deployWebpackage.do,\" triggering what's called a pre-authenticated Server-Side Request Forgery ( SSRF ) owing to the fact that there is \"no filtering as to what hosts can be communicated with.\"\nTo make matters worse, the SSRF flaw could then be escalated to achieve code execution by making use of a ZIP archive file containing a malicious .JSP file. The entire sequence of events is as follows -\nwatchTowr has also created a Detection Artefact Generator that organizations can use to determine if their instance is vulnerable to the vulnerability.\nWith vulnerabilities in backup and replication software like Veeam and NAKIVO coming under active exploitation in the wild, it's essential that users apply necessary mitigations to safeguard against potential threats.",
  "scraped_at": "2025-04-29T07:42:51.645592Z"
}