{
  "source": "hackernews",
  "url": "https://thehackernews.com/2025/04/researchers-identify-rackstatic.html",
  "title": "Researchers Identify Rack::Static Vulnerability Enabling Data Breaches in Ruby Servers",
  "published": null,
  "body": "Cybersecurity researchers have disclosed three security flaws in the Rack Ruby web server interface that, if successfully exploited, could enable attackers to gain unauthorized access to files, inject malicious data, and tamper with logs under certain conditions.\nThe vulnerabilities, flagged by cybersecurity vendor OPSWAT, are listed below -\nSuccessful exploitation of the flaws could permit an attacker to obscure attack traces, read arbitrary files, and inject malicious code.\n\"Among these vulnerabilities, CVE-2025-27610 is particularly severe, as it could enable unauthenticated attackers to retrieve sensitive information, including configuration files, credentials, and confidential data, thereby leading to data breaches,\" OPSWAT said in a report shared with The Hacker News.\nThe shortcoming stems from the fact that Rack::Static , a middleware that's used to serve static content like JavaScript, stylesheets, and images, does not sanitize user-supplied paths before serving files, leading to a scenario where an attacker can provide a specially crafted path to access files outside of the static file directory.\n\"Specifically, when the :root parameter is not explicitly defined, Rack defaults this value to the current working directory by assigning it the value of Dir.pwd, implicitly designating it as the web root directory for the Rack application,\" OPSWAT said.\nAs a result, if the :root option is either undefined or misconfigured relative to the :urls option, an unauthenticated attacker could weaponize CVE-2025-27610 through path traversal techniques to access sensitive files outside the intended web directory.\nTo mitigate the risk posed by the flaw, it's advised to update to the latest version. If immediate patching is not an option, it's recommended to remove usage of Rack::Static, or ensure that root: points at a directory path that only contains files that should be accessed publicly.\nThe disclosure comes as a critical security defect has been unearthed in the Infodraw Media Relay Service (MRS) that allows reading or deletion of arbitrary files via a path traversal vulnerability (CVE-2025-43928, CVSS score: 9.8) in the username parameter in the login page of the system.\nInfodraw is an Israeli maker of mobile video surveillance solutions that are used to transmit audio, video, and GPS data over telecommunications networks. According to the company's website , its devices are used by law enforcement, private investigations, fleet management, and public transport in many countries.\n\"A trivial Path Traversal vulnerability allows it to read out any file from systems for unauthenticated attackers,\" security researcher Tim Philipp Schäfers said in a statement shared with The Hacker News. \"Furthermore an 'Arbitrary File Deletion Vulnerability' exists that allows attackers to delete any file from the system.\"\nThe flaw, which enables login with a username like \"../../../../,\" affects both Windows and Linux versions of MRS. That said, the security defect continues to remain unpatched. Vulnerable systems in Belgium and Luxembourg have been taken offline following responsible disclosure.\n\"Affected organizations are primarily advised to take the application offline immediately (since, despite early warnings, no manufacturer patch is available, and it is considered possible that the vulnerability will be exploited by malicious actors in the near future),\" Philipp Schäfers said .\n\"If this is not possible, systems should be further protected with additional measures (such as using a VPN or specific IP unlocking).\"",
  "scraped_at": "2025-04-29T07:42:51.157402Z"
}