{
  "source": "hackernews",
  "url": "https://thehackernews.com/2025/04/cisa-adds-actively-exploited-broadcom.html",
  "title": "CISA Adds Actively Exploited Broadcom and Commvault Flaws to KEV Database",
  "published": null,
  "body": "The U.S. Cybersecurity and Infrastructure Security Agency (CISA) on Monday added two high-severity security flaws impacting Broadcom Brocade Fabric OS and Commvault Web Server to its Known Exploited Vulnerabilities ( KEV ) catalog, citing evidence of active exploitation in the wild.\nThe vulnerabilities in question are listed below -\n\"Exploiting this vulnerability requires a bad actor to have authenticated user credentials within the Commvault Software environment,\" Commvault said in an advisory released in February 2025.\n\"Unauthenticated access is not exploitable. For software customers, this means your environment must be: (i) accessible via the internet, (ii) compromised through an unrelated avenue, and (iii) accessed leveraging legitimate user credentials.\"\nThe vulnerability affects the following Windows and Linux versions -\nAs for CVE-2025-1976, Broadcom said that due to a flaw in IP Address validation, a local user with the admin privilege can potentially execute arbitrary code with root privileges on Fabric OS versions 9.1.0 through 9.1.1d6. It has been fixed in version 9.1.1d7.\n\"This vulnerability can allow the user to execute any existing Fabric OS command or can also be used to modify the Fabric OS itself, including adding their own subroutines,\" Broadcom noted in a bulletin published on April 17, 2025.\n\"Even though achieving this exploit first requires valid access to a role with admin privileges, this vulnerability has been actively exploited in the field.\"\nThere are currently no public details on how either of the vulnerabilities have been exploited in the wild, the scale of the attacks, and who may be behind them.\nFederal Civilian Executive Branch (FCEB) agencies are recommended to apply the necessary patches for the Commvault Web Server by May 17, 2025, and Broadcom Brocade Fabric OS by May 19, respectively.",
  "scraped_at": "2025-04-29T07:42:50.380360Z"
}