{
  "source": "hackernews",
  "url": "https://thehackernews.com/2025/04/cisa-flags-actively-exploited.html",
  "title": "CISA Flags Actively Exploited Vulnerability in SonicWall SMA Devices",
  "published": null,
  "body": "The U.S. Cybersecurity and Infrastructure Security Agency (CISA) on Wednesday added a security flaw impacting SonicWall Secure Mobile Access ( SMA ) 100 Series gateways to its Known Exploited Vulnerabilities ( KEV ) catalog, based on evidence of active exploitation.\nThe high-severity vulnerability, tracked as CVE-2021-20035 (CVSS score: 7.2), relates to a case of operating system command injection that could result in code execution.\n\"Improper neutralization of special elements in the SMA100 management interface allows a remote authenticated attacker to inject arbitrary commands as a 'nobody' user, which could potentially lead to code execution,\" SonicWall said in an advisory released in September 2021.\nThe flaw impacts SMA 200, SMA 210, SMA 400, SMA 410, and SMA 500v (ESX, KVM, AWS, Azure) devices running the following versions -\nWhile the exact details surrounding the exploitation of CVE-2021-20035 are presently unknown, SonicWall has since revised the bulletin to acknowledge that \"this vulnerability is potentially being exploited in the wild.\"\nFederal Civilian Executive Branch (FCEB) agencies are required to apply the necessary mitigations by May 7, 2025, to secure their networks against active threats.\nArctic Wolf, in a report published this week, said it has been tracking a campaign targeting VPN credential access on SonicWall SMA devices since January 2025. It's suspected that the activity is related to the exploitation of CVE-2021-20035.\n\"One noteworthy aspect of the campaign was the use of a local super admin account (admin@LocalDomain) on these appliances, which has an insecure default password of 'password,'\" security researcher Andres Ramos said . \"It is important to note that even fully patched firewall devices may still become compromised if accounts use poor password hygiene.\"\n\"When accounts on firewalls are compromised independently, vulnerabilities such as CVE-2021-20035 can be used in tandem to establish persistence and widen the scope of attacks.\"\n(The story was updated after publication to include insights from Arctic Wolf.)",
  "scraped_at": "2025-04-29T07:42:52.814581Z"
}